Page({
data:{
  chooseData:[
    {
      title:'学 历',
      options: [//数字是职业权重
        {
          1: -1000,
          2: 10,
          3: -50,
          4: -50,
          5: -100,
          6: -50,
          7: 30,
          8: 50,
          9: 50, 
          10: -1000, 
          11: -1000,
          12: 30,
          name:'初中以下'
        }, 
        {
          1: -1000,
          2: 20,
          3: 0,
          4: 0,
          5: -50,
          6: 10,
          7: 30,
          8: 50,
          9: 50,
          10: -1000,
          11: -1000,
          12: 30,
          name:'高中'
        }, 
        {
          1: -1000,
          2: 30,
          3: 30,
          4: 30,
          5: 30,
          6: 30,
          7: 30,
          8: 30,
          9: 50,
          10: -1000,
          11: -1000,
          12: 30,
          name:'大专'
        },
        {
          1: -1000,
          2: 30,
          3: 40,
          4: 40,
          5: 40,
          6: 40,
          7: 40,
          8: 40,
          9: 30, 
          10: -1000, 
          11: -1000,
          12: 40,
           name:'本科'
        },            
        {
          1: -1000,
          2: 30,
          3: 50,
          4: 40,
          5: 50,
          6: 30,
          7: 50,
          8: 30,
          9: -30,
          10: -1000,
          11: -1000,
          12: 50,
           name:'硕士'
        }, 
         {
           1: -1000,
           2: 30,
           3: 50,
           4: 40,
           5: 50,
           6: 30,
           7: 50,
           8: 30,
           9: -30,
           10: -1000,
           11: -1000,
           12: 50,
           name:'博士'
           }
         ],
      num:0
    },
    {
      title: '性 别',
      options: [
        {
          1: -1000,
          2: 50,
          3: 50,
          4: 50,
          5: 50,
          6: 50,
          7: 50,
          8: 30,
          9: 30, 
          10: -1000, 
          11: -1000,
          12: 30,
          name:'男'
          }, 
        {
          1: -1000,
          2: 50,
          3: 30,
          4: 30,
          5: 10,
          6: -30,
          7: 50,
          8: 50,
          9: 50,
          10: -1000,
          11: -1000,
          12: 50,
          name:'女'
          }],
      num: 0
    },
    {
      title: '年 龄',
      options: [
        {
          1: -1000,
          2: 5,
          3: 0,
          4: 0,
          5: -50,
          6: 15,
          7: 20,
          8: 30,
          9: 50,
          10: -1000,
          11: -1000,
          12: 20,
          name:'18岁以下'
          },
         {
           1: -1000,
           2: 20,
           3: 20,
           4: 20,
           5: 20,
           6: 20,
           7: 20,
           8: 20,
           9: 20,
           10: -1000,
           11: -1000,
           12: 20,
           name:'18~24岁'
           },
          {
            1: -1000,
            2: 20,
            3: 20,
            4: 20,
            5: 20,
            6: 20,
            7: 20,
            8: 20,
            9: 20, 
            10: -1000, 
            11: -1000,
            12: 20,
            name:'25~30岁'
            }, 
          {
            1: -1000,
            2: -30,
            3: -30,
            4: -30,
            5: -30,
            6: -30,
            7: 50,
            8: 0,
            9: 0,
            10: -1000,
            11: -1000,
            12: 50,
            name:'30岁以上'
            }],
      num: 0
    },
    {
      title: '基 础',
      options: [
        {
          1: -1000,
          2: 0,
          3: 0,
          4: 0,
          5: 0,
          6: 0,
          7: 0,
          8: 0,
          9: 0,
          10: -1000,
          11: -1000,
          12: 0,
          name:'无特长'
          },
         {
           1: -1000, 
           2: 0, 
           3: 0, 
           4: 0, 
           5: 0,
           6: 0, 
           7: 0,
           8: 50, 
           9: 0, 
           10: -1000, 
           11: -1000, 
           12: 30,
           name:'绘画基础'
           },
         {
           1: -1000,
           2: 10,
           3: 10,
           4: 10,
           5: 10,
           6: 50,
           7: 0,
           8: 0,
           9: 10,
           10: -1000,
           11: -1000,
           12: 0,
           name: '网络相关'
           },
         {
           1: -1000,
           2: 0,
           3: 0,
           4: 0,
           5: 0,
           6: 0,
           7: 50,
           8: 30,
           9: 10,
           10: -1000,
           11: -1000,
           12: 30,
           name: '原型设计'
           }, 
         {
           1: -1000,
           2: 0, 
           3: 0,
           4: 0, 
           5: 0, 
           6: 0, 
           7: 30, 
           8: 0, 
           9: 0, 
           10: -1000, 
           11: -1000, 
           12: 50,
           name:'文字功底'
           }],
      num: 0
    },
    {
      title: '专 业',
      options: [
        {
          1: -1000,
          2: 30,
          3: 0,
          4: 0,
          5: 0,
          6: 0,
          7: 30,
          8: 50,
          9: 50,
          10: -1000,
          11: -1000,
          12: 30,
          name:'无专业'
          },
        {
          1: -1000,
          2: 35,
          3: 35,
          4: 35,
          5: 50,
          6: 40,
          7: 40,
          8: 40,
          9: 30,
          10: -1000,
          11: -1000,
          12: 40,
          name: '计算机相关'
          },
        {
          1: -1000,
          2: 30,
          3: 35,
          4: 35,
          5: 40,
          6: 30,
          7: 30,
          8: 30,
          9: 30,
          10: -1000,
          11: -1000,
          12: 30,
          name: '理工科'
          }, 
        {
          1: -1000,
          2: 10,
          3: 10,
          4: 10,
          5: 10,
          6: 10,
          7: 50,
          8: 50,
          9: 30,
          10: -1000,
          11: -1000,
          12: 50,
          name:'文科'
          }],
      num: 0
    },
    {
      title: '逻 辑',
      options: [
        {
          1: -1000,
          2: 40,
          3: 10,
          4: 10,
          5: 10,
          6: 10,
          7: 20,
          8: 50,
          9: 50,
          10: -1000,
          11: -1000,
          12: 20,
          name:'渣渣'
          }, 
        {
          1: -1000,
          2: 30,
          3: 30,
          4: 30,
          5: 30,
          6: 30,
          7: 30,
          8: 30,
          9: 30,
          10: -1000,
          11: -1000,
          12: 30,
          name:'普通'
          }, 
        {
          1: -1000,
          2: 40,
          3: 40,
          4: 40,
          5: 50,
          6: 40,
          7: 30,
          8: 0,
          9: 0,
          10: -1000,
          11: -1000,
          12: 30,
          name:'卓越'
          }],
      num: 0
    }
  ]
},
setChange:function(e){
  //将选中的选项value传到常量中的num,num初始为0，默认选中第一项，id是用来确定当前点击的是     列表的哪一行
  this.data.chooseData[e.currentTarget.dataset.id].num = e.detail.value;
  this.setData(//用setData重新修改整个数据
    {chooseData: this.data.chooseData}
  )
},
toChooseJobs:function(){
  //所有职业初始权重都为0
  var score={1:0,2:0,3:0,4:0,5:0,6:0,7:0,8:0,9:0,10:0,11:0,12:0};
  //通过嵌套的两个遍历将所选的全部项目权重都加起来放到score里
  for (var i = 0; i < this.data.chooseData.length;i++){
    //取出所选项权重放到optionsItem里
    var optionsItem = this.data.chooseData[i].options[this.data.chooseData[i].num];
    //用遍历将optionsItem的权重加到score里
    for(var j in score){
      score[j] += optionsItem[j];
    }
  };
  //将最终的score用权重分数进行降序排序后，只留序号，去掉权重分数，转为数字数组，只留下最大的前3个，再转化为JSON格式的字符串放到finallyRank中，map(Number)方法是将字符串数组变成数字数组
  var finallyRank = JSON.stringify((Object.keys(score).sort(function (a, b) { return score[b] - score[a] }).map(Number).slice(0,3)));
  //带着finallyRank参数跳转到下一个页面
  wx.navigateTo({
    url: '../chooseJobs/chooseJobs?finallyRank=' + finallyRank
  })
}
})